# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer overview indent
#+LANGUAGE: pt-br
#+TAGS: noexport(n)
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export

#+Title: Aula de Revisão da Parte #2
#+Subtitle: *INF01202*
#+Author: Prof. Lucas Mello Schnorr
#+Date: \copyleft

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [xcolor=dvipsnames]
#+OPTIONS: title:nil H:1 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel.tex}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{systeme}

#+latex: \newcommand{\mytitle}{Aula de Revisão da Parte #2}
#+latex: \mytitleslide

* Simulado #2

Escreva uma FUNÇÃO RECURSIVA que analisa um arranjo de inteiros v e um
inteiro n recebidos como parâmetros e retorna 1 se o arranjo contiver
o número n e 0 no caso contrário. Defina os demais parâmetros
necessários à função.

*Uma solução*

#+BEGIN_SRC C
#define TAMANHO 5

int recursiva (int v[], int n, int tamanho) {
  if (tamanho == 0) return 0;
  else if (n == v[tamanho-1]) return 1;
  else return recursiva(v, n, tamanho-1);
}

int recur (int *v, int n, int tamanho) {
  if (tamanho == 0) return 0;
  else if (*v == n) return 1;
  else return recur(v+1, n, tamanho-1);
}

int recur3 (int v[], int n, int tamanho, int indice){
  if (tamanho == 0) return 0;
  else if (v[indice] == n) return 1;
  else return recur3(v, n, tamanho-1, indice+1);
}

int main(){
  int achou = 0;
  int vetor[TAMANHO] = {3, 5, 29, 392, 3943};
  achou = recursiva(vetor, 392, TAMANHO);
  printf("achou = %d\n", achou);
  printf("achou = %d\n", recur(vetor, 392, TAMANHO));
}
#+END_SRC

#+RESULTS:
| achou | = | 1 |
| achou | = | 1 |

* Simulado #3

Escreva uma função que recebe um string entrada s1, e devolve, em
outro string saida s2, o string original sem os espaços
brancos. Indique como seria a chamada no programa principal (declare
as variáveis necessárias para a chamada).

*Uma solução*:

#+begin_src C :results output :session :exports both
void simul3 (char *s1, char *s2) {
  while(*s1 != '\0'){
    if (*s1 != ' ') {
      *s2 = *s1;
      s2++;
    }
    s1++;
  }
  *s2 = '\0';
}

int main(){
  char s1[] = "o universo está em expansão";
  char s2[1000];
  simul3(s1, s2);
  printf("s1 vale o seguinte [%s]\n", s1);
  printf("s2 vale o seguinte [%s]\n", s2);
  return 0;
}
#+END_SRC

#+RESULTS:
: s1 vale o seguinte [o universo está em expansão]
: s2 vale o seguinte [ouniversoestáemexpansão]

* Simulado #6

Escreva uma função recursiva ~float funcao(float p, int n)~ que recebe
como entrada um valor real p > 0 e um valor inteiro n. Se n for menor
ou igual a zero, a função deve retornar o valor zero. Caso contrário,
deve retornar o valor da soma.

#+BEGIN_EXPORT latex
\\\bigskip

$\frac{1}{1^p} + \frac{1}{2^p} + \frac{1}{3^p} +  ... +\frac{1}{n^p}$
#+END_EXPORT

*Uma solução*:

#+BEGIN_SRC C :libs "-lm"
#include <math.h>
#include <stdio.h>

float funcao(float p, int n) {
  if (n <= 0) return 0;
  float elemento = 1/pow(n, p);
  return elemento+funcao(p, n-1);
}

int main() {
  printf("%f\n", funcao(2.3, 3));
}
#+END_SRC

#+RESULTS:
: 1.282977

* Simulado #7

Escreva uma função que recebe como parâmetro apenas uma string de no
máximo 30 caracteres e inverte os caracteres da string. A nova string
invertida é escrita em cima da string recebida como parâmetro.
Exemplo ilustrativo:

#+BEGIN_EXAMPLE
Entre com uma string: O rato roeu a roupa do rei de roma.
String invertida: .amor ed ier od apuor a ueor otar O
#+END_EXAMPLE

*Uma solução sem recursão*

#+begin_src C :results output :session :exports both
#include<stdio.h>
#include<string.h>

void inverte(char *s) {
  char grande[30];
  int i;
  for (i = 0; i < strlen(s); i++){
    grande[i] = s[strlen(s) -1 - i];
  }
  grande[i] = '\0';
  strcpy(s, grande);
}

int main() {
  char s[] = "O rato roeu a roupa do rei de roma.";
  printf("Entre com uma string: %s\n", s);
  inverte(s);
  printf("String invertida: %s\n", s);
}
#+END_SRC

#+RESULTS:
: Entre com uma string: O rato roeu a roupa do rei de roma.
: String invertida: .amor ed ier od apuor a ueor otar O

